app/Controllers/Dashboard.php

SELECT COUNT(*) AS `numrows` FROM `products`
SELECT SUM(`final_amount`) AS `final_amount`
FROM `sales`
 LIMIT 1
SELECT *
FROM `sales`
ORDER BY `created_at` DESC
 LIMIT 5
SELECT *
FROM `products`
WHERE `stock_quantity` < 10
---
    public function index()
    {
        $productModel = new ProductModel();
        $saleModel = new SaleModel();
        $categoryModel = new CategoryModel();

        $data = [
            'title' => 'Dashboard',
            'total_products' => $productModel->countAll(),
            'total_sales' => $saleModel->selectSum('final_amount')->first()['final_amount'] ?? 0,
            'recent_sales' => $saleModel->orderBy('created_at', 'DESC')->limit(5)->find(),
            'low_stock' => $productModel->where('stock_quantity <', 10)->findAll(),