app/Controllers/Inventory.php

    public function edit($id)
    {
        $productModel = new ProductModel();
        $categoryModel = new CategoryModel();
        $data = [
            'title' => 'Edit Product',
            'product' => $productModel->find($id),
            'categories' => $categoryModel->findAll()
---
SELECT *
FROM `products`
WHERE `products`.`id` = '1'
SELECT *
FROM `categories`

    public function categories()
    {
        $categoryModel = new CategoryModel();
        $data = [
            'title' => 'Categories',
            'categories' => $categoryModel->findAll()
---
SELECT *
FROM `categories`