app/Controllers/Reports.php

SELECT DATE(created_at) as date, SUM(final_amount) as total
FROM `sales`
GROUP BY DATE(created_at)
ORDER BY `date` DESC
SELECT SUM(`final_amount`) AS `final_amount`
FROM `sales`
 LIMIT 1
---
    public function index()
    {
        $saleModel = new SaleModel();

        $data = [
            'title' => 'Sales Reports',
            'daily_sales' => $saleModel->select('DATE(created_at) as date, SUM(final_amount) as total')
                                      ->groupBy('DATE(created_at)')
                                      ->orderBy('date', 'DESC')
                                      ->findAll(),
            'total_revenue' => $saleModel->selectSum('final_amount')->first()['final_amount'] ?? 0