app/Controllers/Sales.php

SELECT *
FROM `products`
SELECT *
FROM `categories`
---
    public function index()
    {
        $productModel = new ProductModel();
        $categoryModel = new CategoryModel();

        $data = [
            'title' => 'Sales / POS',
            'products' => $productModel->findAll(),
            'categories' => $categoryModel->findAll()

INSERT INTO `sales` (`total_amount`, `discount`, `final_amount`, `paid_amount`, `change_amount`, `created_at`) VALUES ('60', '0', '60', '60', '0', '2026-05-07 08:36:07')
INSERT INTO `sale_items` (`sale_id`, `product_id`, `quantity`, `unit_price`, `subtotal`) VALUES (1, '3', '1', '15', 15)
SELECT *
FROM `products`
WHERE `products`.`id` = '3'
UPDATE `products` SET `stock_quantity` = 39, `updated_at` = '2026-05-07 08:36:07'
WHERE `products`.`id` IN ('3')
---
    public function process()
    {
        $saleModel = new SaleModel();
        $saleItemModel = new SaleItemModel();
        $productModel = new ProductModel();

        $cart = $this->request->getPost('cart');
        $totalAmount = $this->request->getPost('total_amount');
        $discount = $this->request->getPost('discount') ?? 0;
        $finalAmount = $this->request->getPost('final_amount');
        $paidAmount = $this->request->getPost('paid_amount');
        $changeAmount = $this->request->getPost('change_amount');

        if (empty($cart)) {
            return $this->response->setJSON(['status' => 'error', 'message' => 'Cart is empty']);
        }

        $db = \Config\Database::connect();
        $db->transStart();

        $saleId = $saleModel->insert([
            'total_amount' => $totalAmount,
            'discount' => $discount,
            'final_amount' => $finalAmount,
            'paid_amount' => $paidAmount,
            'change_amount' => $changeAmount,
        ]);

        foreach ($cart as $item) {
            $saleItemModel->insert([
                'sale_id' => $saleId,
                'product_id' => $item['id'],
                'quantity' => $item['quantity'],
                'unit_price' => $item['price'],
                'subtotal' => $item['quantity'] * $item['price'],
            ]);

            // Update stock
            $product = $productModel->find($item['id']);
            $productModel->update($item['id'], [
                'stock_quantity' => $product['stock_quantity'] - $item['quantity']
            ]);